//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Usuario o contraseña equivocada";
"_cancelled_by_user"                    = "Transferencia cancelada";
"_error_folder_destiny_is_the_same_"    = "No es posible mover la carpeta dentro de sí misma";
"_error_not_permission_"                = "No tienes los permisos para hacer esta operación";
"_error_path_"                          = "No se pudo habrir este archivo o carpeta. Por favor verifica que exista";
"_file_upload_not_exitst_"              = "El archivo que quieres cargar no existe";
"_forbidden_characters_from_server_"    = "El nombre contiene al menos un caracter inválido";
"_not_connected_internet_"              = "Error de conexión al servidor";
"_not_possible_connect_to_server_"      = "No es posible conectarse al servidor en este momento";
"_not_possible_create_folder_"          = "No fue posible crear la carpeta";
"_server_down_"                         = "No fue posible establecer contacto con el servidor";
"_time_out_"                            = "El tiempo se agotó, favor de reintentar";
"_unknow_response_server_"              = "Respuesta del servidor inesperada";
"_user_autentication_required_"         = "Autenticación del usuario requerida";
"_file_directory_locked_"               = "Archivo o directorio bloqueado";
"_ssl_certificate_untrusted_"           = "El certificado para este servidor es inválido";
"_internal_server_"                     = "Error interno del servidor";
"_file_already_exists_"                 = "No fue posible completar la operación, un archivo con ese nombre ya existe";
"_file_folder_not_exists_"              = "El archivo fuente no se encontró en la ruta especificada";
"_folder_contents_nochanged_"           = "El contendio de la carpeta no ha cambiado";
"_images_invalid_converted_"            = "La imagen es inválida y no puede convertirse a una miniatura";
"_method_not_expected_"                 = "Método de solicitud inesperado";
"_reauthenticate_user_"                 = "El acceso expiró, inicia sesión de nuevo";
"_server_error_retry_"                  = "El servidor se encuentra temporalmente no disponible";
"_too_many_files_"                      = "Demasiados archivos estarían incluidos en esta operación";
"_too_many_request_"                    = "El enviar demasiadas solicitudes causó que se alcanzara la tasa límite ";
"_user_over_quota_"                     = "Se ha alcanzado la cuota de almacenamiento";
"_ssl_connection_error_"                = "Error de la conexión SSL, por favor vuelve a intentarlo";
"_bad_request_"                         = "Solicitud inválida";
"_webdav_locked_"                       = "WebDAV Bloqueado: Tratando de acceder un recurso bloqueado";
"_error_user_not_available_"            = "El usuario ya no está disponible";
"_server_response_error_"               = "Error en el contendio de la respuesta del servidor";


